app/controllers/buildings_controller.rb

  def show
    @buildings = Building.all
    @building = @buildings.find(params[:id])
---
SELECT  "buildings".* FROM "buildings"  WHERE "buildings"."id" = $1 LIMIT 1  [["id", 1]]