app/controllers/sites_controller.rb

SELECT  "sites".* FROM "sites"  WHERE "sites"."id" = $1 LIMIT 1  [["id", 0]]
---
  def show
    @site = Site.find(params[:id])