app/controllers/svgs_controller.rb

SELECT  "svgs".* FROM "svgs"  WHERE "svgs"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    puts params[:id]
    respond_to do |format|
      format.xml {render xml: Svg.find(params[:id]).content}