app/controllers/types_controller.rb

  def index
    @types = Hash.new {|h, k| h[k] = []}
    Type.all.each do |type|
---
SELECT "types".* FROM "types"

  def show
    @type = Type.find(params[:id])
---
SELECT  "types".* FROM "types"  WHERE "types"."id" = $1 LIMIT 1  [["id", 1]]